In [1]:
# импортируем библиотеку pandas для дальнейшей работы
import pandas as pd

In [2]:
#читаем данные из датасета
data = pd.read_csv('data_job_salaries.csv')

#Смотрим информацию про первые 10 строк DataFrame
data.head(10)

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L
5,5,2020,EN,FT,Data Analyst,72000,USD,72000,US,100,US,L
6,6,2020,SE,FT,Lead Data Scientist,190000,USD,190000,US,100,US,S
7,7,2020,MI,FT,Data Scientist,11000000,HUF,35735,HU,50,HU,L
8,8,2020,MI,FT,Business Data Analyst,135000,USD,135000,US,100,US,L
9,9,2020,SE,FT,Lead Data Engineer,125000,USD,125000,NZ,50,NZ,S

In [3]:
#задание №1 ---Сгруппируйте вакансии по направлениями (DS, DE, Software Engenering, etc.)---
data_grouped = data.groupby('job_title')

#задание №2 ---Какая средняя и медианная зарплата по группам вакансий?---
data_grouped_mean_salary = data_grouped['salary_in_usd'].mean()
data_grouped_median_salary = data_grouped['salary_in_usd'].median()

In [4]:
data_grouped_median_salary.head(15)

job_title
3D Computer Vision Researcher           5409.0
AI Scientist                           45896.0
Analytics Engineer                    179850.0
Applied Data Scientist                157000.0
Applied Machine Learning Scientist     56700.0
BI Data Analyst                        76500.0
Big Data Architect                     99703.0
Big Data Engineer                      41305.5
Business Data Analyst                  70912.0
Cloud Data Engineer                   124647.0
Computer Vision Engineer               26304.5
Computer Vision Software Engineer      95746.0
Data Analyst                           90320.0
Data Analytics Engineer                64598.5
Data Analytics Lead                   405000.0
Name: salary_in_usd, dtype: float64

In [5]:
# выводим первые 15 данных датасета по median 
data_grouped_median_salary.head(15)

job_title
3D Computer Vision Researcher           5409.0
AI Scientist                           45896.0
Analytics Engineer                    179850.0
Applied Data Scientist                157000.0
Applied Machine Learning Scientist     56700.0
BI Data Analyst                        76500.0
Big Data Architect                     99703.0
Big Data Engineer                      41305.5
Business Data Analyst                  70912.0
Cloud Data Engineer                   124647.0
Computer Vision Engineer               26304.5
Computer Vision Software Engineer      95746.0
Data Analyst                           90320.0
Data Analytics Engineer                64598.5
Data Analytics Lead                   405000.0
Name: salary_in_usd, dtype: float64

In [6]:
#задание №3 ---Какая средняя и медианная зарплата по каждому региону?---
data_grouped_region = data.groupby('company_location')
data_grouped_mean_region = data_grouped_region['salary_in_usd'].mean()
data_grouped_median_region = data_grouped_region['salary_in_usd'].median()

In [7]:
data_grouped_mean_region.head(15)

company_location
AE    100000.000000
AS     18053.000000
AT     72920.750000
AU    108042.666667
BE     85699.000000
BR     18602.666667
CA     99823.733333
CH     64114.000000
CL     40038.000000
CN     71665.500000
CO     21844.000000
CZ     50937.000000
DE     81887.214286
DK     54386.333333
DZ    100000.000000
Name: salary_in_usd, dtype: float64

In [8]:
data_grouped_median_region.head(15)

company_location
AE    115000.0
AS     18053.0
AT     69489.5
AU     87425.0
BE     85699.0
BR     18907.0
CA     81895.5
CH     64114.0
CL     40038.0
CN     71665.5
CO     21844.0
CZ     50937.0
DE     78015.0
DK     45896.0
DZ    100000.0
Name: salary_in_usd, dtype: float64

In [9]:
#задание №4 ---Какая самая высокооплачиваемая из групп вакансий, исходя из их средних зарплат?---
max_paid_job = data_grouped_mean_salary.idxmax()

max_mean_salary = data_grouped_mean_salary.max()

In [10]:
print(max_paid_job) 

print(max_mean_salary)

Data Analytics Lead
405000.0

In [11]:
#задание №5 ---Какое процентное соотношение каждого региона по вакансиям от всех вакансий?---
vac_count_by_reg = data['company_location'].value_counts()

#считаем процент
percent_vac_by_reg = (vac_count_by_reg/len(data))*100

#добавляем в DataFrame столбцы с новыми названиями и передаем туда значения
data_perc_reg = pd.DataFrame({'vac_count_by_reg': vac_count_by_reg, 'percent_vac_by_reg': percent_vac_by_reg})

data_perc_reg.head(10)

    vac_count_by_reg  percent_vac_by_reg
US               355           58.484349
GB                47            7.742998
CA                30            4.942339
DE                28            4.612850
IN                24            3.953871
FR                15            2.471170
ES                14            2.306425
GR                11            1.812191
JP                 6            0.988468
NL                 4            0.658979

In [12]:
#задание №6 ---Какая корреляция уровня опыта от зарплаты? (Преобразовать уровень опыта в числовой тип, если возможно. 
#например: 'MI': 0, 'SE': 1, 'EN': 2, 'EX': 3)---

lvl_numbere = {'MI': 0, 'SE': 1, 'EN': 2, 'EX': 3}

data['lvl_numbere'] = data['experience_level'].map(lvl_numbere)

corr = data['lvl_numbere'].corr(data['salary_in_usd'])

corr

0.1509237256253246

In [13]:
#задание №7 ---Сколько должностей в наборе данных?---
cnt_job_title = data['job_title'].nunique()

cnt_job_title

50

In [14]:
#задание №8 ---Какие 10 наиболее часто встречающихся должностей?---
top_position_name = data['job_title'].value_counts()

top_position_name.head(10)

Data Scientist                143
Data Engineer                 132
Data Analyst                   97
Machine Learning Engineer      41
Research Scientist             16
Data Science Manager           12
Data Architect                 11
Big Data Engineer               8
Machine Learning Scientist      8
Principal Data Scientist        7
Name: job_title, dtype: int64